#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cert_manager.google_project_iam_member.cert_manager_dns_admin will be created
  + resource "google_project_iam_member" "cert_manager_dns_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cert-manager-dns01-prod@infra-480802.iam.gserviceaccount.com"
      + project = "infra-480802"
      + role    = "roles/dns.admin"
    }

  # module.cert_manager.google_service_account.cert_manager_dns will be created
  + resource "google_service_account" "cert_manager_dns" {
      + account_id   = "cert-manager-dns01-prod"
      + description  = "Service Account for cert-manager to manage Cloud DNS records for DNS-01 challenge"
      + disabled     = false
      + display_name = "cert-manager DNS-01 Solver"
      + email        = "cert-manager-dns01-prod@infra-480802.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:cert-manager-dns01-prod@infra-480802.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "infra-480802"
      + unique_id    = (known after apply)
    }

  # module.cert_manager.google_service_account_iam_member.cert_manager_workload_identity will be created
  + resource "google_service_account_iam_member" "cert_manager_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:infra-480802.svc.id.goog[cert-manager/cert-manager]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.cert_manager.google_service_account_key.cert_manager_dns_key will be created
  + resource "google_service_account_key" "cert_manager_dns_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cert_manager.helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.16.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "global.leaderElection.namespace"
          + value = "cert-manager"
        }
      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "cert-manager"
        }
    }

  # module.cert_manager.kubernetes_namespace.cert_manager will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "disabled"
            }
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cert_manager.kubernetes_secret.clouddns_dns01_solver will be created
  + resource "kubernetes_secret" "clouddns_dns01_solver" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "clouddns-dns01-solver-sa"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cert_manager.kubernetes_service_account.cert_manager will be created
  + resource "kubernetes_service_account" "cert_manager" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "cert-manager-dns01-prod@infra-480802.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "cert-manager"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gke.google_container_node_pool.spot_pool_large will be updated in-place
  ~ resource "google_container_node_pool" "spot_pool_large" {
        id                          = "projects/infra-480802/locations/asia-northeast3-a/clusters/woohalabs-prod-gke/nodePools/woohalabs-prod-spot-large"
        name                        = "woohalabs-prod-spot-large"
      ~ node_count                  = 1 -> 0
        # (9 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count       = 3 -> 2
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.gke.google_container_node_pool.spot_pool_medium will be updated in-place
  ~ resource "google_container_node_pool" "spot_pool_medium" {
        id                          = "projects/infra-480802/locations/asia-northeast3-a/clusters/woohalabs-prod-gke/nodePools/woohalabs-prod-spot-medium"
        name                        = "woohalabs-prod-spot-medium"
      ~ node_count                  = 1 -> 2
        # (9 unchanged attributes hidden)

      ~ autoscaling {
          ~ max_node_count       = 3 -> 2
          ~ min_node_count       = 1 -> 2
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 2 to change, 0 to destroy.

```

</details>

---

**To apply this plan, comment:**
- `apply` or `ok` or `terraform apply`

*Pusher: @ggorockee, Action: `pull_request`, Workflow: `GCP Terraform Plan`*